#include "game/obj.h"

#include <inttypes.h>

#include "game/item.h"
#include "game/obj_file.h"
#include "game/obj_find.h"
#include "game/obj_private.h"
#include "game/oname.h"
#include "game/skill.h"
#include "game/spell.h"
#include "game/stat.h"
#include "game/tech.h"

#define OBJ_FILE_VERSION 119

// CE: The type of `data` and `transient_properties` is changed to `intptr_t` to
// handle complex fields (virtually everything besides plain integers is stored
// as pointers).
typedef struct Object {
    /* 0000 */ int type;
    /* 0008 */ ObjectID oid;
    /* 0020 */ ObjectID prototype_oid;
    /* 0038 */ int64_t prototype_obj;
    /* 0040 */ int field_40;
    /* 0044 */ int16_t modified;
    /* 0046 */ int16_t num_fields;
    /* 0048 */ int* field_48;
    /* 004C */ int* field_4C;
    /* 0050 */ intptr_t* data;
    /* 0054 */ intptr_t transient_properties[19];
} Object;

typedef bool(ObjEnumerateCallback)(Object* object, int fld);

typedef struct ObjectFieldInfo {
    /* 0000 */ int simple_array_idx;
    /* 0004 */ int complex_array_idx;
    /* 0008 */ int change_array_idx;
    /* 000C */ unsigned int mask;
    /* 0010 */ int bit;
    /* 0014 */ int cnt;
    /* 0018 */ int type;
} ObjectFieldInfo;

typedef bool(ObjEnumerateCallbackEx)(Object* object, int fld, ObjectFieldInfo* field_info);

static void object_field_not_exists(Object* object, int fld);
static void obj_debug_aid(tig_art_id_t aid);
static Object* obj_allocate(int64_t* obj_ptr);
static Object* obj_lock(int64_t obj);
static void obj_unlock(int64_t obj);
static void obj_field_store(Object* object, int fld, void* value_ptr);
static void obj_arrayfield_store(Object* object, int fld, int index, void* value_ptr);
static void obj_field_fetch(Object* object, int fld, void* value_ptr);
static void obj_arrayfield_fetch(Object* object, int fld, int index, void* value);
static void sub_408D60(Object* object, int fld, int* value_ptr);
static void sub_408E70(Object* object, int fld, int value);
static bool sub_408F40(Object* object, int fld, SizeableArray*** ptr, int64_t* proto_handle_ptr);
static void obj_set_defaults(int64_t obj);
