#include "game/script.h"

#include "game/ai.h"
#include "game/anim.h"
#include "game/animfx.h"
#include "game/area.h"
#include "game/bless.h"
#include "game/combat.h"
#include "game/critter.h"
#include "game/curse.h"
#include "game/dialog.h"
#include "game/effect.h"
#include "game/gmovie.h"
#include "game/gsound.h"
#include "game/item.h"
#include "game/level.h"
#include "game/li.h"
#include "game/location.h"
#include "game/mes.h"
#include "game/monstergen.h"
#include "game/mp_utils.h"
#include "game/multiplayer.h"
#include "game/newspaper.h"
#include "game/object.h"
#include "game/player.h"
#include "game/portal.h"
#include "game/quest.h"
#include "game/random.h"
#include "game/reaction.h"
#include "game/reputation.h"
#include "game/rumor.h"
#include "game/script_name.h"
#include "game/scroll.h"
#include "game/sector.h"
#include "game/skill.h"
#include "game/spell.h"
#include "game/stat.h"
#include "game/tb.h"
#include "game/teleport.h"
#include "game/trap.h"
#include "game/ui.h"

#define MAX_CACHE_ENTRIES 100
#define MAX_GLOBAL_VARS 2000
#define MAX_GLOBAL_FLAGS 100

#define NEXT -1
#define RETURN_AND_SKIP_DEFAULT -2
#define RETURN_AND_RUN_DEFAULT -3

typedef struct ScriptCacheEntry {
    /* 0000 */ int script_id;
    /* 0008 */ DateTime datetime;
    /* 0010 */ int ref_count;
    /* 0014 */ ScriptFile* file;
} ScriptCacheEntry;

typedef struct ScriptState {
    /* 0000 */ ScriptInvocation* invocation;
    /* 0004 */ int field_4;
    /* 0008 */ int loop_cnt;
    /* 000C */ int field_C;
    /* 0010 */ int script_num;
    /* 0014 */ int field_14;
    /* 0018 */ int64_t current_loop_obj;
    /* 0020 */ int64_t objs[100];
    /* 0340 */ ObjectList objects;
    /* 0398 */ int field_398;
    /* 039C */ int lc_vars[10];
    /* 03C4 */ int field_3C4;
    /* 03C8 */ int64_t lc_objs[10];
} ScriptState;

static int script_execute_condition(ScriptCondition* condition, int line, ScriptState* state);
static int script_execute_action(ScriptAction* action, int line, ScriptState* state);
static bool sub_44AFF0(TimeEvent* timeevent);
static void sub_44B030(ScriptAction* action, ScriptState* state);
static void sub_44B170(ScriptAction* action, ScriptState* state);
static void script_float_line(ScriptAction* action, ScriptState* state);
static void script_print_line(ScriptAction* action, ScriptState* state);
static int script_resolve_focus_obj(ScriptFocusObject type, int index, ScriptState* state, int64_t* objs, ObjectList* l);
static void sub_44B8F0(ScriptFocusObject type, ObjectList* l);
static int64_t script_get_obj(ScriptFocusObject type, int index, ScriptState* state);
static void script_set_obj(ScriptFocusObject type, int index, ScriptState* state, int64_t obj);
